Revit 2024 API
DirectShapeTypeOptions Constructor
 Constructs a new DirectShapeTypeOptions instance with default settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public DirectShapeTypeOptions()
Visual Basic
Public Sub New
Visual C++
public:
DirectShapeTypeOptions()
See Also
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace